let ScannerList =
externaldata(ToolName:string)
[
  @"https://raw.githubusercontent.com/CyberArk0961/Scanner-Tools/refs/heads/main/All_Scanners_Tool_Names.csv"
]
with (format="csv", ignoreFirstRecord=true)
| project ToolLower = tolower(ToolName);
DeviceProcessEvents
| where Timestamp > ago(30d)
| extend ProcLower = tolower(ProcessName)
| where ProcLower has_any (ScannerList)
| project
    Timestamp,
    DeviceName,
    AccountName,
    ProcessName,
    CommandLine,
    FolderPath,
    SHA256
| sort by Timestamp desc
